Can't Paste Aligned to some views.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotPasteAlignedSomeLevels { get; }
  Visual Basic
Public Shared ReadOnly Property CannotPasteAlignedSomeLevels As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotPasteAlignedSomeLevels {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace